cli/ss.html
<!DOCTYPE html>
<html>
<head>
<title>Ss</title>
<!-- 2018-02-07 Wed 11:28 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Ss</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本知识</a>
<ul>
<li><a href="#sec-1-1">1.1. 统计原理</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Total: 4049</a></li>
<li><a href="#sec-1-1-2">1.1.2. TCP: 3649</a></li>
<li><a href="#sec-1-1-3">1.1.3. estab 3291</a></li>
<li><a href="#sec-1-1-4">1.1.4. closed 31</a></li>
<li><a href="#sec-1-1-5">1.1.5. orphaned 0</a></li>
<li><a href="#sec-1-1-6">1.1.6. synrecv 0</a></li>
<li><a href="#sec-1-1-7">1.1.7. ports 831</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 状态</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 常见用法</a>
<ul>
<li><a href="#sec-2-1">2.1. 显示所有已建立的 HTTP 连接</a></li>
<li><a href="#sec-2-2">2.2. 显示 keepalive 信息</a></li>
<li><a href="#sec-2-3">2.3. 显示 raw sockets</a></li>
<li><a href="#sec-2-4">2.4. 指定源 IP</a></li>
<li><a href="#sec-2-5">2.5. 显示使用套接字的进程信息</a></li>
<li><a href="#sec-2-6">2.6. 端口过滤</a></li>
<li><a href="#sec-2-7">2.7. 指定目标网段</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本知识</a>
<ul>
<li><a href="#sec-1-1">1.1. 统计原理</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Total: 4049</a></li>
<li><a href="#sec-1-1-2">1.1.2. TCP: 3649</a></li>
<li><a href="#sec-1-1-3">1.1.3. estab 3291</a></li>
<li><a href="#sec-1-1-4">1.1.4. closed 31</a></li>
<li><a href="#sec-1-1-5">1.1.5. orphaned 0</a></li>
<li><a href="#sec-1-1-6">1.1.6. synrecv 0</a></li>
<li><a href="#sec-1-1-7">1.1.7. ports 831</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 状态</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 常见用法</a>
<ul>
<li><a href="#sec-2-1">2.1. 显示所有已建立的 HTTP 连接</a></li>
<li><a href="#sec-2-2">2.2. 显示 keepalive 信息</a></li>
<li><a href="#sec-2-3">2.3. 显示 raw sockets</a></li>
<li><a href="#sec-2-4">2.4. 指定源 IP</a></li>
<li><a href="#sec-2-5">2.5. 显示使用套接字的进程信息</a></li>
<li><a href="#sec-2-6">2.6. 端口过滤</a></li>
<li><a href="#sec-2-7">2.7. 指定目标网段</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-02-07 11:28:11</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本知识</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 统计原理</h3>
<div class="outline-text-3" id="text-1-1">
<p>
数据是通过 <code>/proc/net/sockstat</code> 统计得出
</p>

<pre class="example">
#&gt; ss -s
Total: 4049 (kernel 4179)
TCP:   3649 (estab 3291, closed 31, orphaned 0, synrecv 0, timewait 28/0), ports 831

Transport Total     IP        IPv6
          4179      -         -
RAW       0         0         0
UDP       249       138       111
TCP       3618      3604      14
INET      3867      3742      125
FRAG      98        98        0
</pre>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Total: 4049</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
已使用的所有协议套接字总量
</p>

<div class="org-src-container">

<pre class="src src-sh">cat /proc/net/sockstat | head -1
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> TCP: 3649</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<code>sockstat.tcp_total + slabstat.tcp_syns + sockstat.tcp_tws</code>
</p>

<ul class="org-ul">
<li><code>sockstat.tcp_total</code>

<p>
已分配(已建立, 已申请到 sk_buff )的TCP套接字数量
</p>

<div class="org-src-container">

<pre class="src src-sh">grep -o <span style="color: #00afaf;">'alloc [0-9]*'</span> /proc/net/sockstat
</pre>
</div>
</li>

<li><code>slabstat.tcp_syns</code>

<div class="org-src-container">

<pre class="src src-sh">grep -o <span style="color: #00afaf;">'tcp_open_request\s*[0-9]*'</span> /proc/slabinfo
</pre>
</div>
</li>
</ul>


<ul class="org-ul">
<li><code>sockstat.tcp_tws</code>

<div class="org-src-container">

<pre class="src src-sh">grep -o <span style="color: #00afaf;">'tw [0-9]*'</span> /proc/net/sockstat
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> estab 3291</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
<code>snmp_stat.tcp_estab</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">grep <span style="color: #00afaf;">'Tcp:'</span> /proc/net/snmp | cut -f10 -d<span style="color: #00afaf;">' '</span>
</pre>
</div>

<p>
其值等于: <code>ss -at | grep ESTAB  | wc -l</code>
</p>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> closed 31</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
<code>sockstat.tcp_total - (sockstat.tcp4_hashed + sockstat.tcp6_hashed - sockstat.tcp_tws)</code>
</p>

<ul class="org-ul">
<li><code>sockstat.tcp4_hashed</code>

<p>
正在使用(包括侦听)的 TCP 套接字数量
</p>

<div class="org-src-container">

<pre class="src src-sh">grep -o <span style="color: #00afaf;">'TCP: inuse [0-9]*'</span> /proc/net/sockstat
</pre>
</div>
</li>

<li><code>sockstat.tcp6_hashed</code>

<div class="org-src-container">

<pre class="src src-sh">grep -o <span style="color: #00afaf;">'TCP6: inuse [0-9]*'</span> /proc/net/sockstat6
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> orphaned 0</h4>
<div class="outline-text-4" id="text-1-1-5">
<ul class="org-ul">
<li>无主(不属于任何进程)的 TCP 连接数 (无用, 待销毁的 TCP socket 数)
</li>
<li>没有和 fd 绑定的 socket， <b>通常在 close 之后的一小段时间内存在</b>
</li>
</ul>

<p>
<code>sockstat.tcp_orphans</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">grep -o <span style="color: #00afaf;">'orphan [0-9]*'</span> /proc/net/sockstat
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> synrecv 0</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
<code>slabstat.tcp_syns</code>
</p>

<div class="org-src-container">

<pre class="src src-sh">grep -o <span style="color: #00afaf;">'tcp_open_request\s*[0-9]*'</span> /proc/slabinfo
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-7" class="outline-4">
<h4 id="sec-1-1-7"><span class="section-number-4">1.1.7</span> ports 831</h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
统计所有正在使用的端口数量
</p>

<p>
<code>slabstat.tcp_ports</code>
</p>

<pre class="example">
grep -o 'tcp_bind_bucket\s*[0-9]*' /proc/slabinfo
</pre>
</div>
</div>
</div>




<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 状态</h3>
<div class="outline-text-3" id="text-1-2">
<p>
常用 state:
</p>

<ul class="org-ul">
<li>established
</li>
<li>syn-sent
</li>
<li>syn-recv
</li>
<li>fin-wait-1
</li>
<li>fin-wait-2
</li>
<li>time-wait
</li>
<li>closed
</li>
<li>close-wait
</li>
<li>last-ack
</li>
<li>listen
</li>
<li>closing
</li>
<li>all : All of the above states
</li>
<li>connected : All the states except for listen and closed
</li>
<li>synchronized : All the connected states except for syn-sent
</li>
<li>bucket : Show states, which are maintained as minisockets, i.e. time-wait and syn-recv
</li>
<li>big : Opposite to bucket state
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 常见用法</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 显示所有已建立的 HTTP 连接</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh">ss state established <span style="color: #00afaf;">'( dport = :http or sport = :http )'</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 显示 keepalive 信息</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh">ss -o
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 显示 raw sockets</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-sh">ss -w
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 指定源 IP</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-sh">ss src &lt;ip&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 显示使用套接字的进程信息</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-sh">ss -p
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 端口过滤</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">

<pre class="src src-sh">ss dport &lt;op&gt; &lt;port&gt;
</pre>
</div>

<p>
<code>op</code> 是运算符, <code>port</code> 表示端口, 常见运算符：
</p>



<ul class="org-ul">
<li>&lt;= or le  : 小于等于
</li>
<li>&gt;= or ge  : 大于等于
</li>
<li>== or eq  : 等于
</li>
<li>!= or ne  : 不等于端口
</li>
<li>&lt;  or lt  : 小于这个端口
</li>
<li>&gt;  or gt  : 大于端口
</li>
</ul>


<div class="org-src-container">

<pre class="src src-sh">ss sport = :http <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#20063;&#21487;&#20197;&#26159; ss sport = :80</span>
ss dport = :http

ss dport <span style="color: #00afaf;">\&gt;</span> :1024
ss sport <span style="color: #00afaf;">\&gt;</span> :1024
ss sport <span style="color: #00afaf;">\&lt;</span> :32000
ss sport eq :22
ss dport != :22
ss <span style="color: #00afaf;">\(</span> sport = :http or sport = :https <span style="color: #00afaf;">\)</span>

ss state connected sport = :http
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 指定目标网段</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">

<pre class="src src-sh">ss -o state fin-wait-1 <span style="color: #00afaf;">\(</span> sport = :http or sport = :https <span style="color: #00afaf;">\)</span> dst 192.168.1/24
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>